---
kind: other
id: Methods.T:Autodesk.Revit.DB.PlanTopology
source: html/f1d05b89-57c0-5f10-ceb7-12bb57f2da64.htm
---
# PlanTopology Methods

Causes the object to release immediately any resources it may be utilizing.